NatiYilma/cardinal-grip/cardinal-grip-s3/src/firmware/esp32_generic.cpp
// src/firmware/esp32_generic.cpp
// ================================

#include "esp32_generic.h"
#include <esp_partition.h>

#if ENABLE_WIFI
  #include "credentials.h"
  #include <WiFi.h>
  #include <WebServer.h>
  #include <WebSocketsServer.h>
  #include <ESPmDNS.h>
  #include <Update.h>
  #include <ArduinoOTA.h>
  #include <Preferences.h>
  static const char* cg_wifi_ssid     = CG_WIFI_SSID;
  static const char* cg_wifi_password = CG_WIFI_PASSWORD;
#endif

#if ENABLE_BT && defined(BOARD_S3)
  #include <BLEDevice.h>
  #include <BLEServer.h>
  #include <BLEUtils.h>
  #include <BLE2902.h>

  // Very simple BLE-UART style setup for S3-only build

  static BLEServer*         cg_bleServer       = nullptr;
  static BLECharacteristic* cg_bleTxChar       = nullptr;
  static bool               cg_bleConnected    = false;
  static bool               cg_bleWasConnected = false;

  // Custom UUIDs (Can be changed)
  static constexpr char CG_BLE_SERVICE_UUID[] = "6E400001-B5A3-F393-E0A9-E50E24DCCA9E";
  static constexpr char CG_BLE_TX_CHAR_UUID[] = "6E400003-B5A3-F393-E0A9-E50E24DCCA9E"; // notify-only

  class CgBleServerCallbacks : public BLEServerCallbacks {
  public:
    void onConnect(BLEServer* /*pServer*/) override {
      cg_bleConnected = true;
    }
    void onDisconnect(BLEServer* /*pServer*/) override {
      cg_bleConnected = false;
    }
  };
#endif

// ==========================================================
// BOARD / PARTITION INFO (debug helper)
// ==========================================================
void cg_printPartitions() {
#if ENABLE_SERIAL
  const esp_partition_t *p = nullptr;

  Serial.println();
  Serial.println(F("===== App partitions ====="));
  esp_partition_iterator_t it_app =
    esp_partition_find(ESP_PARTITION_TYPE_APP,
                       ESP_PARTITION_SUBTYPE_ANY,
                       nullptr);

  while (it_app) {
    p = esp_partition_get(it_app);
    Serial.printf("  label=%s type=%d subtype=%d addr=0x%06lx size=%lu bytes\n",
                  p->label,
                  p->type,
                  p->subtype,
                  (unsigned long)p->address,
                  (unsigned long)p->size);
    it_app = esp_partition_next(it_app);
  }
  esp_partition_iterator_release(it_app);

  Serial.println(F("===== Data partitions ====="));
  esp_partition_iterator_t it_data =
    esp_partition_find(ESP_PARTITION_TYPE_DATA,
                       ESP_PARTITION_SUBTYPE_ANY,
                       nullptr);

  while (it_data) {
    p = esp_partition_get(it_data);
    Serial.printf("  label=%s type=%d subtype=%d addr=0x%06lx size=%lu bytes\n",
                  p->label,
                  p->type,
                  p->subtype,
                  (unsigned long)p->address,
                  (unsigned long)p->size);
    it_data = esp_partition_next(it_data);
  }
  esp_partition_iterator_release(it_data);

  Serial.println();
#endif
}

// ==========================================================
// STATUS LED IMPLEMENTATION
// ==========================================================
#if ENABLE_STATUS_LED

// Adjust these if the boards use different LED pins
#if defined(BOARD_32D)
static const int STATUS_LED_PIN = 2;     // typical ESP32 devkit LED
#elif defined(BOARD_S3)
static const int STATUS_LED_PIN = 13;    // Feather ESP32-S3 "LED" pin
#else
static const int STATUS_LED_PIN = -1;    // no LED
#endif

static bool     g_samplingActive    = true;   // fast (true) vs slow (false) blink
static uint32_t g_ledLastToggleMs   = 0;
static bool     g_ledIsOn           = false;

// Simple helper for "event" patterns (Wi-Fi / BT / OTA / error)
static void cg_ledBlinkNTimes(uint8_t n, uint16_t onMs, uint16_t offMs) {
  if (STATUS_LED_PIN < 0) return;
  for (uint8_t i = 0; i < n; ++i) {
    digitalWrite(STATUS_LED_PIN, HIGH);
    delay(onMs);
    digitalWrite(STATUS_LED_PIN, LOW);
    delay(offMs);
  }
}

#endif  // ENABLE_STATUS_LED

void cg_initStatusLed() {
#if ENABLE_STATUS_LED
  if (STATUS_LED_PIN >= 0) {
    pinMode(STATUS_LED_PIN, OUTPUT);
    digitalWrite(STATUS_LED_PIN, LOW);
    g_ledLastToggleMs = millis();
    g_ledIsOn = false;
  }
#endif
}

void cg_setSamplingActive(bool active) {
#if ENABLE_STATUS_LED
  g_samplingActive = active;
#else
  (void)active;
#endif
}

void cg_tickStatusLed() {
#if ENABLE_STATUS_LED
  if (STATUS_LED_PIN < 0) return;

  const uint32_t now      = millis();
  const uint32_t interval = g_samplingActive ? 200u : 800u;  // fast vs slow

  if (now - g_ledLastToggleMs >= interval) {
    g_ledLastToggleMs = now;
    g_ledIsOn = !g_ledIsOn;
    digitalWrite(STATUS_LED_PIN, g_ledIsOn ? HIGH : LOW);
  }
#endif
}

// ==========================================================
// WIFI / WEBSOCKET / HTTP SERVER / OTA CONFIG
// ==========================================================
#if ENABLE_WIFI

// ---- Wi-Fi credentials ----
//
// 1) Compile-time defaults from credentials.h
// 2) Optional stored credentials in NVS ("wifi" namespace)
//    - If present, we prefer stored over compile-time.
//    - You can change them from the /wifi config page.

static const char* cg_default_wifi_ssid     = CG_WIFI_SSID;
static const char* cg_default_wifi_password = CG_WIFI_PASSWORD;

// If STA fails, we fall back to AP mode with these:
static const char* cg_ap_ssid       = "CardinalGrip_AP";
static const char* cg_ap_password   = "SqueezyPeasy1";   // 8+ chars required

// WebSocket for streaming sample data
static WebSocketsServer cg_webSocket(81);   // ws://<ip>:81

// HTTP server for OTA web UI + Wi-Fi config
static WebServer cg_httpServer(80);

// Track whether Wi-Fi is up (STA or AP)
static bool cg_wifi_ready = false;

// NVS storage for Wi-Fi credentials
static Preferences cg_wifiPrefs;
static bool        cg_haveStoredWifi = false;
static String      cg_storedSsid;
static String      cg_storedPass;

// Forward declarations for HTTP handlers
static void cg_handleHttpRoot();
static void cg_handleHttpUpdatePage();
static void cg_handleHttpUpdatePost();
static void cg_handleHttpUpdateUpload();

