NatiYilma/cardinal-grip/cardinal-grip-s3/src/firmware/esp32_generic.cpp
// Wi-Fi config HTML handlers
static void cg_handleHttpWifiPage();
static void cg_handleHttpWifiPost();
static void cg_handleHttpWifiForget();

// JSON API endpoints for Qt / PC integration
static void cg_handleApiWifiStatus();
static void cg_handleApiWifiScan();
static void cg_handleApiWifiConfig();
static void cg_handleApiWifiForget();

// WebSocket event (extend later for commands if needed)
static void cg_webSocketEvent(uint8_t num, WStype_t type,
                              uint8_t * payload, size_t length) {
  (void)num;
  (void)type;
  (void)payload;
  (void)length;
}

// ----------------------------------------------------------
// Wi-Fi event logger (AP STA connect/disconnect etc.)
// ----------------------------------------------------------
static void cg_wifiEvent(WiFiEvent_t event) {
#if ENABLE_SERIAL
  switch (event) {
    case ARDUINO_EVENT_WIFI_AP_START:
      Serial.println(F("[WiFi] EVENT: AP started"));
      break;
    case ARDUINO_EVENT_WIFI_AP_STOP:
      Serial.println(F("[WiFi] EVENT: AP stopped"));
      break;
    case ARDUINO_EVENT_WIFI_AP_STACONNECTED:
      Serial.println(F("[WiFi] EVENT: Station connected to AP"));
      break;
    case ARDUINO_EVENT_WIFI_AP_STADISCONNECTED:
      Serial.println(F("[WiFi] EVENT: Station disconnected from AP"));
      break;
    case ARDUINO_EVENT_WIFI_AP_PROBEREQRECVED:
      Serial.println(F("[WiFi] EVENT: AP probe request received"));
      break;
    default:
      Serial.print(F("[WiFi] EVENT: "));
      Serial.println((int)event);
      break;
  }
#endif
}

// ----------------------------------------------------------
// Stored Wi-Fi helpers
// ----------------------------------------------------------
static void cg_loadStoredWifi() {
  cg_haveStoredWifi = false;
  cg_storedSsid = "";
  cg_storedPass = "";

  if (!cg_wifiPrefs.begin("wifi", false)) {
#if ENABLE_SERIAL
    Serial.println(F("[WiFi] Preferences begin() failed"));
#endif
    return;
  }

  cg_storedSsid = cg_wifiPrefs.getString("ssid", "");
  cg_storedPass = cg_wifiPrefs.getString("pass", "");

  // Close the namespace so later begin() calls (save/clear) succeed
  cg_wifiPrefs.end();

  cg_haveStoredWifi = (cg_storedSsid.length() > 0);

#if ENABLE_SERIAL
  if (cg_haveStoredWifi) {
    Serial.print(F("[WiFi] Found stored SSID: "));
    Serial.println(cg_storedSsid);
  } else {
    Serial.println(F("[WiFi] No stored Wi-Fi credentials"));
  }
#endif
}

static void cg_saveStoredWifi(const String& ssid, const String& pass) {
  if (!cg_wifiPrefs.begin("wifi", false)) {
#if ENABLE_SERIAL
    Serial.println(F("[WiFi] Preferences begin() failed (save)"));
#endif
    return;
  }

  cg_wifiPrefs.putString("ssid", ssid);
  cg_wifiPrefs.putString("pass", pass);
  cg_wifiPrefs.end();

#if ENABLE_SERIAL
  Serial.print(F("[WiFi] Saved Wi-Fi SSID: "));
  Serial.println(ssid);
#endif
}

static void cg_clearStoredWifi() {
  if (!cg_wifiPrefs.begin("wifi", false)) {
#if ENABLE_SERIAL
    Serial.println(F("[WiFi] Preferences begin() failed (clear)"));
#endif
    return;
  }

  cg_wifiPrefs.clear();
  cg_wifiPrefs.end();

  cg_haveStoredWifi = false;
  cg_storedSsid = "";
  cg_storedPass = "";

#if ENABLE_SERIAL
  Serial.println(F("[WiFi] Cleared stored Wi-Fi credentials"));
#endif
}

// ==========================================================
// WIFI INIT – AP always on, STA best-effort
// Priority:
//   1) Stored credentials in NVS (user-provided)
//   2) Compile-time defaults (DEV ONLY, optional)
//   3) AP-only if nothing to try
// Also starts WebSocket, HTTP server, and mDNS.
// ==========================================================
void cg_initWiFi() {
#if ENABLE_WIFI
  cg_wifi_ready = false;

#if ENABLE_SERIAL
  Serial.println(F("[WiFi] === WIFI INIT (AP + optional STA) ==="));
#endif

  // Log AP/STA events
  WiFi.onEvent(cg_wifiEvent);

  // Clean slate
  WiFi.persistent(false);
  WiFi.disconnect(true, true);

  // AP + STA
  WiFi.mode(WIFI_AP_STA);

  // ---------- Start AP (always) ----------
#if ENABLE_SERIAL
  Serial.print(F("[WiFi] Starting AP: "));
  Serial.println(cg_ap_ssid);
#endif

  // Channel 1, visible SSID, up to 4 clients
  bool ap_ok = WiFi.softAP(cg_ap_ssid, cg_ap_password, 1, 0, 4);
  if (!ap_ok) {
#if ENABLE_SERIAL
    Serial.println(F("[WiFi] softAP() FAILED; Wi-Fi will be unavailable."));
#endif
    return;  // nothing else to do
  }

  delay(300);

#if ENABLE_SERIAL
  Serial.print(F("[WiFi] AP IP: "));
  Serial.println(WiFi.softAPIP());
#endif

  // ---------- Decide which STA credentials to try ----------
  cg_loadStoredWifi();   // may set cg_haveStoredWifi + cg_storedSsid/pass

  String staSsid;
  String staPass;

  if (cg_haveStoredWifi) {
    // 1) User-provided, stored in NVS
    staSsid = cg_storedSsid;
    staPass = cg_storedPass;
#if ENABLE_SERIAL
    Serial.print(F("[WiFi] Using STORED SSID: "));
    Serial.println(staSsid);
#endif
  } else {
    // 2) DEV-ONLY fallback: compile-time defaults
    //    For production builds, you can set these to template values
    //    so this branch effectively does nothing.
    if (cg_default_wifi_ssid && strlen(cg_default_wifi_ssid) > 0 &&
        strcmp(cg_default_wifi_ssid, "YOUR_WIFI_SSID_HERE") != 0) {
      staSsid = String(cg_default_wifi_ssid);
      staPass = String(cg_default_wifi_password);
#if ENABLE_SERIAL
      Serial.print(F("[WiFi] Using DEFAULT compile-time SSID (DEV): "));
      Serial.println(staSsid);
#endif
    } else {
#if ENABLE_SERIAL
      Serial.println(F("[WiFi] No stored creds and no valid dev default; STA will be skipped."));
#endif
    }
  }

  // ---------- Try STA connect (if we have something to try) ----------
  if (staSsid.length() > 0) {
#if ENABLE_SERIAL
    Serial.print(F("[WiFi] Connecting as STA to SSID: "));
    Serial.println(staSsid);
#endif

    WiFi.begin(staSsid.c_str(), staPass.c_str());

    unsigned long start      = millis();
    const unsigned long tout = 8000UL;   // 8s max

    while (WiFi.status() != WL_CONNECTED && (millis() - start) < tout) {
      delay(250);
#if ENABLE_SERIAL
      Serial.print('.');
#endif
    }

#if ENABLE_SERIAL
    Serial.println();
    wl_status_t st = WiFi.status();
    Serial.print(F("[WiFi] STA status after attempt: "));
    Serial.print((int)st);
    Serial.print(F(" ("));
    switch (st) {
      case WL_IDLE_STATUS:     Serial.print(F("IDLE")); break;
      case WL_NO_SSID_AVAIL:   Serial.print(F("NO SSID")); break;
      case WL_SCAN_COMPLETED:  Serial.print(F("SCAN COMPLETE")); break;
      case WL_CONNECTED:       Serial.print(F("CONNECTED")); break;
      case WL_CONNECT_FAILED:  Serial.print(F("CONNECT FAILED")); break;
      case WL_CONNECTION_LOST: Serial.print(F("CONNECTION LOST")); break;
      case WL_DISCONNECTED:    Serial.print(F("DISCONNECTED")); break;
      default:                 Serial.print(F("UNKNOWN")); break;
    }
    Serial.println(F(")"));

    Serial.println(F("[WiFi] WiFi.printDiag():"));
    WiFi.printDiag(Serial);
#endif
  } else {
#if ENABLE_SERIAL
    Serial.println(F("[WiFi] Skipping STA connect (no credentials)."));
#endif
  }

  // At this point AP is definitely up; STA may or may not be.
  cg_wifi_ready = true;

  // ---------- Start WebSocket + HTTP server ----------
  cg_webSocket.begin();
  cg_webSocket.onEvent(cg_webSocketEvent);

  cg_httpServer.on("/", HTTP_GET, cg_handleHttpRoot);
  cg_httpServer.on("/update", HTTP_GET, cg_handleHttpUpdatePage);
  cg_httpServer.on("/update", HTTP_POST,
                   cg_handleHttpUpdatePost,
                   cg_handleHttpUpdateUpload);

  // Wi-Fi config endpoints (HTML portal)
  cg_httpServer.on("/wifi",        HTTP_GET,  cg_handleHttpWifiPage);
  cg_httpServer.on("/wifi",        HTTP_POST, cg_handleHttpWifiPost);
  cg_httpServer.on("/wifi/forget", HTTP_POST, cg_handleHttpWifiForget);

