NatiYilma/cardinal-grip/cardinal-grip-s3/src/firmware/esp32_generic.cpp
  // JSON Wi-Fi API for Qt / PC app
  cg_httpServer.on("/api/wifi/status", HTTP_GET,  cg_handleApiWifiStatus);
  cg_httpServer.on("/api/wifi/scan",   HTTP_GET,  cg_handleApiWifiScan);
  cg_httpServer.on("/api/wifi/config", HTTP_POST, cg_handleApiWifiConfig);
  cg_httpServer.on("/api/wifi/forget", HTTP_POST, cg_handleApiWifiForget);

  cg_httpServer.onNotFound([]() {
    cg_httpServer.send(404, "text/plain", "Not found");
  });

  cg_httpServer.begin();

#if ENABLE_SERIAL
  Serial.println(F("[WiFi] HTTP/WebSocket servers started"));
#endif

  // ---------- mDNS (only if STA connected) ----------
  if (WiFi.status() == WL_CONNECTED) {
    if (MDNS.begin("cardinal-grip")) {
#if ENABLE_SERIAL
      Serial.println(F("[mDNS] Service started as cardinal-grip.local"));
#endif
      MDNS.addService("http",    "tcp", 80);
      MDNS.addService("ws",      "tcp", 81);
      MDNS.addService("arduino", "tcp", 3232);
    } else {
#if ENABLE_SERIAL
      Serial.println(F("[mDNS] Failed to start mDNS (STA)"));
#endif
    }
  } else {
#if ENABLE_SERIAL
    Serial.println(F("[mDNS] Skipping mDNS (STA not connected)"));
#endif
  }

#if ENABLE_SERIAL
  Serial.println(F("[WiFi] === WIFI INIT COMPLETE ==="));
#endif

#endif // ENABLE_WIFI
}

// (Old cg_initWiFi() retained here as commented reference)
// void cg_initWiFi() {
//   ...
// }

// ==========================================================
// HTTP HANDLERS (WEB-BASED OTA UI + Wi-Fi config)
// ==========================================================

// Simple landing page
static void cg_handleHttpRoot() {
  String page =
    "<!DOCTYPE html><html><head><title>Cardinal Grip</title></head><body>"
    "<h1>Cardinal Grip ESP32</h1>"
    "<p>Firmware streaming is active.</p>";

  // Show Wi-Fi status
  if (WiFi.getMode() & WIFI_STA) {
    if (WiFi.status() == WL_CONNECTED) {
      page += "<p>Mode: STA, SSID: " + WiFi.SSID() + "</p>";
      page += "<p>IP: " + WiFi.localIP().toString() + "</p>";
    } else {
      page += "<p>Mode: STA, not connected</p>";
    }
  }
  if (WiFi.getMode() & WIFI_AP) {
    page += "<p>AP SSID: ";
    page += cg_ap_ssid;
    page += " (IP: ";
    page += WiFi.softAPIP().toString();
    page += ")</p>";
  }

  page +=
    "<p><a href=\"/wifi\">Wi-Fi Setup</a></p>"
    "<p><a href=\"/update\">Firmware Update</a></p>"
    "</body></html>";

  cg_httpServer.send(200, "text/html", page);
}

// Firmware update form
static void cg_handleHttpUpdatePage() {
  String page =
    "<!DOCTYPE html><html><head><title>OTA Update</title></head><body>"
    "<h1>Firmware OTA Update</h1>"
    "<form method='POST' action='/update' enctype='multipart/form-data'>"
    "<input type='file' name='firmware'>"
    "<input type='submit' value='Update'>"
    "</form>"
    "<p><a href=\"/\">Back</a></p>"
    "</body></html>";
  cg_httpServer.send(200, "text/html", page);
}

// Called after upload end
static void cg_handleHttpUpdatePost() {
  bool ok = !Update.hasError();
  cg_httpServer.sendHeader("Connection", "close");
  cg_httpServer.send(200, "text/plain", ok ? "OK" : "FAIL");

#if ENABLE_SERIAL
  Serial.println(ok ? F("[HTTP OTA] Update successful, restarting soon")
                    : F("[HTTP OTA] Update failed"));
#endif

#if ENABLE_STATUS_LED
  if (ok) {
    cg_ledBlinkNTimes(2, 160, 160);
  } else {
    cg_ledBlinkNTimes(5, 80, 80);
  }
#endif

  // Allow some time for client to receive response
  delay(1000);
  if (ok) {
    ESP.restart();
  }
}

// Upload handler
static void cg_handleHttpUpdateUpload() {
  HTTPUpload& upload = cg_httpServer.upload();

  if (upload.status == UPLOAD_FILE_START) {
#if ENABLE_SERIAL
    Serial.printf("[HTTP OTA] Upload start: %s\n", upload.filename.c_str());
#endif
#if ENABLE_STATUS_LED
    cg_ledBlinkNTimes(4, 80, 80);   // indicate OTA start
#endif

    // Compute max available space for new sketch
    size_t maxSketchSpace = (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
    if (!Update.begin(maxSketchSpace)) {
#if ENABLE_SERIAL
      Serial.println(F("[HTTP OTA] Update.begin() failed"));
#endif
    }
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    // Flash write
    if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
#if ENABLE_SERIAL
      Serial.println(F("[HTTP OTA] Write error"));
#endif
    }
  } else if (upload.status == UPLOAD_FILE_END) {
    if (Update.end(true)) {
#if ENABLE_SERIAL
      Serial.printf("[HTTP OTA] Update Success: %u bytes\n", upload.totalSize);
#endif
    } else {
#if ENABLE_SERIAL
      Serial.println(F("[HTTP OTA] Update.end() failed"));
#endif
    }
  } else if (upload.status == UPLOAD_FILE_ABORTED) {
    Update.end();
#if ENABLE_SERIAL
    Serial.println(F("[HTTP OTA] Upload aborted"));
#endif
#if ENABLE_STATUS_LED
    cg_ledBlinkNTimes(5, 80, 80);
#endif
  }
}

// ----------------------------------------------------------
// Wi-Fi config portal handlers (HTML)
// ----------------------------------------------------------

// Show scan results + form
static void cg_handleHttpWifiPage() {
  String page =
    "<!DOCTYPE html><html><head><title>Wi-Fi Setup</title></head><body>"
    "<h1>Wi-Fi Setup</h1>";

  // Current status
  if (WiFi.getMode() & WIFI_STA) {
    if (WiFi.status() == WL_CONNECTED) {
      page += "<p>Current STA: " + WiFi.SSID() + " (";
      page += WiFi.localIP().toString();
      page += ")</p>";
    } else {
      page += "<p>STA not connected.</p>";
    }
  }

  // Scan for networks
  page += "<h2>Available Networks</h2>";
  int n = WiFi.scanNetworks();
  if (n <= 0) {
    page += "<p>No networks found (try again).</p>";
  } else {
    page += "<form method='POST' action='/wifi'>";
    page += "<p>Select SSID:</p>";
    for (int i = 0; i < n; ++i) {
      String s = WiFi.SSID(i);
      int32_t rssi = WiFi.RSSI(i);
      page += "<label>";
      page += "<input type='radio' name='ssid' value='" + s + "'>";
      page += s + " (RSSI " + String(rssi) + " dBm)";
      if (WiFi.encryptionType(i) != WIFI_AUTH_OPEN) {
        page += " 🔒";
      }
      page += "</label><br>";
    }
    page += "<p>Password: <input type='password' name='password'></p>";
    page += "<p><input type='submit' value='Save & Reboot'></p>";
    page += "</form>";
  }

