NatiYilma/cardinal-grip/cardinal-grip-s3/src/firmware/esp32_generic.cpp
  // Forget stored creds
  page += "<h2>Stored Credentials</h2>";
  if (cg_haveStoredWifi) {
    page += "<p>Stored SSID: " + cg_storedSsid + "</p>";
    page += "<form method='POST' action='/wifi/forget'>"
            "<input type='submit' value='Forget Stored Wi-Fi'>"
            "</form>";
  } else {
    page += "<p>No stored Wi-Fi.</p>";
  }

  page += "<p><a href=\"/\">Back</a></p>";
  page += "</body></html>";

  cg_httpServer.send(200, "text/html", page);
}

// Handle "Save & Reboot"
static void cg_handleHttpWifiPost() {
  String ssid     = cg_httpServer.arg("ssid");
  String password = cg_httpServer.arg("password");

  if (ssid.length() == 0) {
    cg_httpServer.send(400, "text/plain", "SSID required");
    return;
  }

  cg_saveStoredWifi(ssid, password);

  cg_httpServer.send(
    200,
    "text/html",
    "<!DOCTYPE html><html><body>"
    "<p>Saved Wi-Fi credentials for SSID: " + ssid + "</p>"
    "<p>Device will reboot and try to connect.</p>"
    "</body></html>"
  );

  delay(1000);
  ESP.restart();
}

// Handle "Forget"
static void cg_handleHttpWifiForget() {
  cg_clearStoredWifi();
  cg_httpServer.send(
    200,
    "text/html",
    "<!DOCTYPE html><html><body>"
    "<p>Stored Wi-Fi credentials cleared.</p>"
    "<p><a href=\"/wifi\">Back to Wi-Fi Setup</a></p>"
    "</body></html>"
  );
}

// ----------------------------------------------------------
// JSON Wi-Fi API for Qt / desktop app
// ----------------------------------------------------------

// Helper to JSON-encode a string without quotes escaping (simplified).
// NOTE: SSIDs with quotes are rare; if you hit one, this may break JSON.
static String cg_jsonEscape(const String &s) {
  String out;
  out.reserve(s.length() + 4);
  for (size_t i = 0; i < s.length(); ++i) {
    char c = s[i];
    if (c == '"' || c == '\\') {
      out += '\\';
      out += c;
    } else if (c == '\n') {
      out += "\\n";
    } else if (c == '\r') {
      out += "\\r";
    } else {
      out += c;
    }
  }
  return out;
}

// GET /api/wifi/status
static void cg_handleApiWifiStatus() {
  uint8_t mode = WiFi.getMode();
  String modeStr;
  if (mode == WIFI_OFF)          modeStr = "off";
  else if (mode == WIFI_STA)     modeStr = "sta";
  else if (mode == WIFI_AP)      modeStr = "ap";
  else if (mode == WIFI_AP_STA)  modeStr = "ap_sta";
  else                           modeStr = "unknown";

  bool staConnected = (WiFi.status() == WL_CONNECTED);

  String json = "{";
  json += "\"mode\":\"" + modeStr + "\"";
  json += ",\"sta_connected\":"; json += staConnected ? "true" : "false";

  if (staConnected) {
    json += ",\"sta_ssid\":\"" + cg_jsonEscape(WiFi.SSID()) + "\"";
    json += ",\"sta_ip\":\"" + WiFi.localIP().toString() + "\"";
  }

  if (mode & WIFI_AP) {
    json += ",\"ap_ssid\":\"" + cg_jsonEscape(String(cg_ap_ssid)) + "\"";
    json += ",\"ap_ip\":\"" + WiFi.softAPIP().toString() + "\"";
  }

  if (cg_haveStoredWifi) {
    json += ",\"stored_ssid\":\"" + cg_jsonEscape(cg_storedSsid) + "\"";
  } else {
    json += ",\"stored_ssid\":null";
  }

  json += "}";
  cg_httpServer.send(200, "application/json", json);
}

// GET /api/wifi/scan
static void cg_handleApiWifiScan() {
  int n = WiFi.scanNetworks();
  String json = "[";

  for (int i = 0; i < n; ++i) {
    if (i > 0) json += ",";
    String ssid = WiFi.SSID(i);
    int32_t rssi = WiFi.RSSI(i);
    wifi_auth_mode_t enc = WiFi.encryptionType(i);

    json += "{";
    json += "\"ssid\":\"" + cg_jsonEscape(ssid) + "\"";
    json += ",\"rssi\":" + String(rssi);
    json += ",\"secure\":"; json += (enc == WIFI_AUTH_OPEN ? "false" : "true");
    json += "}";
  }

  json += "]";
  cg_httpServer.send(200, "application/json", json);
}

// POST /api/wifi/config  (form fields: ssid, password)
static void cg_handleApiWifiConfig() {
  String ssid     = cg_httpServer.arg("ssid");
  String password = cg_httpServer.arg("password");

  if (ssid.length() == 0) {
    cg_httpServer.send(
      400, "application/json",
      "{\"status\":\"error\",\"error\":\"ssid_required\"}"
    );
    return;
  }

  cg_saveStoredWifi(ssid, password);

  String json = "{\"status\":\"ok\",\"ssid\":\"";
  json += cg_jsonEscape(ssid);
  json += "\"}";

  cg_httpServer.send(200, "application/json", json);

#if ENABLE_SERIAL
  Serial.print(F("[WiFi] API config: saved SSID: "));
  Serial.println(ssid);
#endif

  delay(800);
  ESP.restart();
}

// POST /api/wifi/forget
static void cg_handleApiWifiForget() {
  cg_clearStoredWifi();
  cg_httpServer.send(200, "application/json", "{\"status\":\"ok\"}");

#if ENABLE_SERIAL
  Serial.println(F("[WiFi] API forget: cleared stored Wi-Fi"));
#endif
}

#endif  // ENABLE_WIFI

// ==========================================================
// BLUETOOTH CONFIG
// ==========================================================
#if ENABLE_BT && defined(BOARD_32D)
// 32D -> Bluetooth Classic (SPP) only, used for streaming CSV for now.
static BluetoothSerial SerialBT;
#endif

// ==========================================================
// FSR PINS INIT
// ==========================================================
void cg_initFsrPins() {
  for (int i = 0; i < NUM_FINGERS; ++i) {
    pinMode(fingerPins[i], INPUT);
  }
}

// ==========================================================
// BLUETOOTH INIT (BLE)
// ==========================================================
void cg_initBluetooth() {
#if ENABLE_BT && defined(BOARD_S3)
  // Initialize BLE stack
  BLEDevice::init("CardinalGrip_S3");

  cg_bleServer = BLEDevice::createServer();
  cg_bleServer->setCallbacks(new CgBleServerCallbacks());

  BLEService* service = cg_bleServer->createService(CG_BLE_SERVICE_UUID);

  cg_bleTxChar = service->createCharacteristic(
    CG_BLE_TX_CHAR_UUID,
    BLECharacteristic::PROPERTY_NOTIFY
  );

  // Add CCC descriptor so clients can enable notifications
  cg_bleTxChar->addDescriptor(new BLE2902());

  service->start();

  BLEAdvertising* advertising = BLEDevice::getAdvertising();
  advertising->addServiceUUID(CG_BLE_SERVICE_UUID);
  advertising->setScanResponse(true);
  advertising->setMinPreferred(0x06);
  advertising->setMaxPreferred(0x12);
  advertising->start();

#if ENABLE_SERIAL
  Serial.println(F("[BLE] S3 BLE UART started (CardinalGrip_S3)"));
#endif
#if ENABLE_STATUS_LED
  // Triple blink to indicate BT/BLE is ready
  cg_ledBlinkNTimes(3, 120, 120);
#endif
#else
  // BT disabled or not S3; do nothing
#endif
}

// ==========================================================
// OTA INIT (ArduinoOTA + HTTP-based OTA)
// ==========================================================
void cg_initOta() {
#if ENABLE_WIFI
  if (!cg_wifi_ready) {
#if ENABLE_SERIAL
    Serial.println(F("[OTA] Skipping OTA init (no Wi-Fi)."));
#endif
    return;
  }

#if ENABLE_SERIAL
  Serial.println(F("[OTA] Initializing ArduinoOTA..."));
#endif

  ArduinoOTA.setHostname("cardinal-grip");

  ArduinoOTA.onStart([]() {
#if ENABLE_SERIAL
    Serial.println(F("[OTA] Start"));
#endif
#if ENABLE_STATUS_LED
    // Indicate OTA start: 4 quick blinks
    cg_ledBlinkNTimes(4, 80, 80);
#endif
  });

  ArduinoOTA.onEnd([]() {
#if ENABLE_SERIAL
    Serial.println(F("\n[OTA] End"));
#endif
#if ENABLE_STATUS_LED
    // 2 slower blinks to indicate successful OTA completion
    cg_ledBlinkNTimes(2, 160, 160);
#endif
  });

  ArduinoOTA.onError([](ota_error_t error) {
#if ENABLE_SERIAL
    Serial.printf("[OTA] Error[%u]: ", error);
    if      (error == OTA_AUTH_ERROR)    Serial.println("Auth Failed");
    else if (error == OTA_BEGIN_ERROR)   Serial.println("Begin Failed");
    else if (error == OTA_CONNECT_ERROR) Serial.println("Connect Failed");
    else if (error == OTA_RECEIVE_ERROR) Serial.println("Receive Failed");
    else if (error == OTA_END_ERROR)     Serial.println("End Failed");
#endif
#if ENABLE_STATUS_LED
    // Error: rapid 5-blink
    cg_ledBlinkNTimes(5, 80, 80);
#endif
  });

  ArduinoOTA.begin();

#if ENABLE_SERIAL
  Serial.println(F("[OTA] ArduinoOTA ready"));
#endif

#else
  // OTA over Wi-Fi not available if Wi-Fi is disabled
#endif
}

// ==========================================================
// TRANSPORT LOOP TICK
// ==========================================================
void cg_tickTransports() {
#if ENABLE_WIFI
  cg_webSocket.loop();
#endif

#if ENABLE_BT && defined(BOARD_S3)
  // Simple reconnect logic: restart advertising after disconnect
  if (!cg_bleConnected && cg_bleWasConnected && cg_bleServer) {
    delay(500);
    BLEDevice::getAdvertising()->start();
    cg_bleWasConnected = cg_bleConnected;
  }
  if (cg_bleConnected && !cg_bleWasConnected) {
    cg_bleWasConnected = cg_bleConnected;
  }
#endif
}

// ==========================================================
// OTA LOOP HANDLER (ArduinoOTA + HTTP server)
// ==========================================================
void cg_handleOta() {
#if ENABLE_WIFI
  if (!cg_wifi_ready) return;
  ArduinoOTA.handle();
  cg_httpServer.handleClient();
#else
  // No Wi-Fi = no OTA
#endif
}

// ==========================================================
// SAMPLE READING
// ==========================================================
void cg_readFsrSample(FsrSample &sample) {
  sample.timestamp_ms = millis();
  for (int i = 0; i < NUM_FINGERS; ++i) {
    sample.values[i] = analogRead(fingerPins[i]);
  }
}

// ==========================================================
// SEND HELPERS
// ==========================================================
void cg_sendSampleSerial(const FsrSample &sample) {
#if ENABLE_SERIAL
  // Match the Python fsr_reader.py file(s): CSV values only
  for (int i = 0; i < NUM_FINGERS; ++i) {
    Serial.print(sample.values[i]);
    if (i < NUM_FINGERS - 1) Serial.print(',');
  }
  Serial.println();
#else
  (void)sample;
#endif
}

void cg_sendSampleWebSocket(const FsrSample &sample) {
#if ENABLE_WIFI
  String msg;
  msg.reserve(NUM_FINGERS * 6);

  msg += sample.values[0];
  for (int i = 1; i < NUM_FINGERS; ++i) {
    msg += ",";
    msg += sample.values[i];
  }

  cg_webSocket.broadcastTXT(msg);
#else
  (void)sample;
#endif
}

void cg_sendSampleBluetooth(const FsrSample &sample) {
#if ENABLE_BT && defined(BOARD_S3)
  if (!cg_bleConnected || !cg_bleTxChar) {
    return;
  }

  // Format as CSV: v0,v1,v2,v3
  char buf[64];
  int  len = 0;

  for (int i = 0; i < NUM_FINGERS; ++i) {
    int written = snprintf(
      buf + len,
      sizeof(buf) - len,
      (i == 0) ? "%d" : ",%d",
      sample.values[i]
    );
    if (written < 0) break;
    len += written;
    if (len >= (int)sizeof(buf)) {
      len = sizeof(buf) - 1;
      break;
    }
  }

  cg_bleTxChar->setValue((uint8_t*)buf, len);
  cg_bleTxChar->notify();
#else
  (void)sample;
#endif
}

void cg_sendSampleAllTransports(const FsrSample &sample) {
  cg_sendSampleSerial(sample);
  cg_sendSampleWebSocket(sample);
  cg_sendSampleBluetooth(sample);
}
